# -*- org-export-babel-evaluate: nil; org-export-allow-bind-keywords: t -*-
#+SETUPFILE: ~/.emacs.d/SETUPFILE.org
#+TITLE: Linux package management with GNU Guix
#+DATE: <2015-06-08 Mon>
#+AUTHOR: Malcolm Cook
#+EMAIL: malcolm.cook@gmail.com

# #+INCLUDE: "./MakingTheCase.org" org
# #+INCLUDE: "./biobrewConcerns.org" org


** Configuration of quix

Difference from http://www.gnu.org/software/Guix/manual/Guix.html :
 - /gnu/store is nfs mounted read/write everywhere
 - /gnu is owned by new user, Guix (instead of root)
 - Guix-daemon runs as Guix (not root)

GUIX_DAEMON_SOCKET: "Actually, clients honor the (undocumented) ‘GUIX_DAEMON_SOCKET’
environment variables, so that’s one thing you could use."

#+CAPTION: example of running a single test which proving the install
#+BEGIN_SRC sh
make check TESTS=tests/syscalls.scm 
#+END_SRC


#+CAPTION: Make the "builder users" and their group... 
#+BEGIN_SRC sh
sudo groupadd Guix-builder # already exists

for i in `seq 1 10`; do
    sudo useradd -g Guix-builder  -G Guix-builder           \
                 -d /var/empty -s `which nologin`          \
                 -c "Guix build user $i" \
                 Guix-builder$i;
  done

## NOT: in the above --system          \

# Make the /gnu/store directory, where packages are kept/built
#sudo -u Guix mkdir -p /gnu/store

sudo -u Guix chgrp -R Guix-builder /gnu/store
sudo -u Guix chmod -R 1775 /gnu/store

## TODO: do we really want/need to permissions to be 3775 - u=rwx,g=rwx,a=rx sticky and set gid
## chgrp -R Guix-builder 

ls Guix/tests/*.log | xargs -i echo "{}\n" && cat {} >> Guix/test.logs

#+END_SRC
Notes:
 - purpose of builder user accounts is to allow the daemon process to offload
   package building while keeping things nicely contained

#+CAPTION: produce confirmatory report on the "builder user"
#+BEGIN_SRC sh
getent passwd Guix
getent group Guix-builder
getent passwd Guix-builder1
#+END_SRC

#+RESULTS:
: Guix:$1$E5Ru3NpE$wZZY.cM8TwbRMHBI1UP110:3036:20302:Guix build user:/var/empty:/bin/bash
: Guix-builder:!:20302:Guix-builder1,Guix-builder2,Guix-builder3,Guix-builder4,Guix-builder5,Guix-builder6,Guix-builder7,Guix-builder8,Guix-builder9,Guix-builder10
: Guix-builder1:!!:3048:20302:Guix build user 1:/var/empty:/sbin/nologin

#+CAPTION: Create startup script to deploy within /etc/profile.d
#+BEGIN_SRC sh
sudo cat <<EOF > sce_Guix.sh
???
EOF
#+END_SRC

** packages installed on mango that we would probably want to uninstall

 #+BEGIN_SRC sh
ssh mec@mango
find -L /n/local/bin -maxdepth 2 -type f -executable -exec bash -c 'ldd {} | grep \"not found'" > /dev/null' \; -print
 #+END_SRC

 #+RESULTS:


 #+BEGIN_SRC sh :results output :session *shell*
ssh mango
find -L /n/local/bin -maxdepth 2 -type f -executable -exec bash -c 'ldd {} | grep "not found" ' -print \; | tee | grep -v 'not found' | sort | uniq -c
 #+END_SRC

 #+RESULTS:
 : find: File system loop detected; ‘/n/local/bin/mpich2/bin’ is part of the same file system loop as ‘/n/local/bin/mpich2’.

 these packages are on top of the original base install image

 #+RESULTS:

 #+BEGIN_SRC sh
sudo yum install  gmp gmp-devel # needed by pandoc

sudo yum install libtk (needed by R library MASS and expected to be found on local host).


yum install freeglut-devel

Installed:
  freeglut-devel.x86_64 0:2.8.1-3.el7                                           

Dependency Installed:
  freeglut.x86_64 0:2.8.1-3.el7                                                 
  gl-manpages.noarch 0:1.1-7.20130122.el7                                       
  libX11-devel.x86_64 0:1.6.3-2.el7                                             
  libXau-devel.x86_64 0:1.0.8-2.1.el7                                           
  libXdamage-devel.x86_64 0:1.1.4-4.1.el7                                       
  libXext-devel.x86_64 0:1.3.3-3.el7                                            
  libXfixes-devel.x86_64 0:5.0.1-2.1.el7                                        
  libXxf86vm-devel.x86_64 0:1.1.3-2.1.el7                                       
  libdrm-devel.x86_64 0:2.4.60-3.el7                                            
  libxcb-devel.x86_64 0:1.11-4.el7                                              
  libxshmfence.x86_64 0:1.2-1.el7                                               
  libxshmfence-devel.x86_64 0:1.2-1.el7                                         
  mesa-libGL-devel.x86_64 0:10.6.5-3.20150824.el7                               
  mesa-libGLU.x86_64 0:9.0.0-4.el7                                              
  mesa-libGLU-devel.x86_64 0:9.0.0-4.el7                                        
  xorg-x11-proto-devel.noarch 0:7.7-12.el7                                      

Dependency Updated:
  libX11.x86_64 0:1.6.3-2.el7                                                   
  libX11-common.noarch 0:1.6.3-2.el7                                            
  libXext.x86_64 0:1.3.3-3.el7                                                  
  libdrm.x86_64 0:2.4.60-3.el7                                                  
  libxcb.x86_64 0:1.11-4.el7                                                    
  mesa-libEGL.x86_64 0:10.6.5-3.20150824.el7                                    
  mesa-libGL.x86_64 0:10.6.5-3.20150824.el7                                     
  mesa-libgbm.x86_64 0:10.6.5-3.20150824.el7                                    
  mesa-libglapi.x86_64 0:10.6.5-3.20150824.el7                                  


 #+END_SRC
